Autodesk.Revit.DB.InternalOrigin.Get(Autodesk.Revit.DB.Document)
Gets the internal origin for the document.
document:
Revit document from which to get the internal origin.
Returns:
The internal origin of the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020.2

Autodesk.Revit.DB.InternalOrigin
A class representing the origin of internal coordinate system.
Each Revit project contains one InternalOrigin.
Remarks:
The internal origin cannot be selected (e.g. as a reference) nor can it be modified.
Since:
2021